Repository: mozilla-l10n/mt-training-data
Catalog: ln/ln_pontoon.tmx
Source language: en_us
Languages: ln

source: It seems your account has already been activated.
ln: Emonani neti compte nayo eza déjà activé.

source: It's fun and addictive and the Awesome is you!
ln: Eza ya kosepelisa mpe ekozwa yo mobimba na Mosepelisi eza yo!

source: I understand, don't show this again.
ln: Nayoki, kolakisa yango lisusu te.

source: Join our Army of Awesome
ln: Sangana na oyo ya biso Ebele ya Kosepelisa

source: Jump to:
ln: Pimbwa na:

source: Just edit articles in your language!
ln: Bongisa kaka baarticle na lokota nayo!

source: Just once or twice
ln: Kaka mbala moko to mibale

source: KB Dashboard
ln: Tableau de bord ya Oyo Etali Boyebi

source: KB Editor - Help to update knowledge base articles that need changes or write new articles:
ln: Editeur KB - Salisa kosala ba mise à jour ya baarticle eye etali boyebi oyo esengeli na mbongwana to koma baarticle yasika:

source: KB Team
ln: Equipe ya Oyo Etali Boyebi

source: Keep in touch with your contacts through email and messaging.
ln: Zala na communication na bacontact nayo na nzela ya email mpe bamessage.

source: Keep your information safe with Firefox for Android's privacy and security settings.
ln: Batela bainfo nayo na baparamètre ya confidentialité mpe bokengi ya Firefox mpo na Android.

source: Keep your information safe with Firefox OS locks, privacy features and more.
ln: Batela bainfo nayo malamu na bacaractèristique ya Firefox OS ya vérrouillage, ya confidentialité mpe misusu.

source: Keep your information safe with password and security settings
ln: Batela bainfo nayo malamu na bacaractèristique ya liloba ya sekele mpe bokengi

source: Keywords:
ln: Ba mots clés:

source: Keywords in {locale}:
ln: Ba mots clés na {locale}:

source: Kitsune Contributor
ln: Contributeur Kitsune

source: Knowledge Base
ln: Oyo Etali Boyebi

source: Knowledge Base Dashboard
ln: Tableau de bord ya Oyo Etali Boyebi

source: KPI Dashboard
ln: Tableau de bord KPI

source: L10N Contributor - Help to translate Firefox Help content to your language:
ln: Contributeur L10N - Salisa kolimbola contenu ya Lisalisi Firefox na lokota nayo:

source: L10n coverage
ln: Couverture L10n

source: L10n Coverage
ln: Couverture L10n

source: <label>Needs Change:</label> %(comment)s
ln: <label>Esengeli na Mbongwana:</label> %(comment)s

source: <label>Revision Comment:</label> {comment}
ln: <label>Commentaire Ya Revision:</label> {comment}

source: Language
ln: Lokota

source: Languages
ln: Nkota

source: Last 30 days
ln: Mikolo 30 mileki

source: Last 7 days
ln: Mikolo 7 mileki

source: Last 90 days
ln: Mikolo 90 mileki

source: Last answer date
ln: Mokolo ya eyano yasuka

source: Last Post
ln: Article Yasuka

source: Last post date
ln: Mokolo ya article yasuka

source: Last reply by
ln: Eyano yasuka ya

source: Last reply by {user}
ln: Eyano yasuka ya {user}

source: Last updated:
ln: Esalemaki mise à jour ya suka:

source: Last updated by:
ln: Esalemaki mise à jour ya suka na:

source: Last Week
ln: Poso eleki

source: Learn all about Thunderbird controls and functionality.
ln: Yekola nionso na maye matali bacontrôle mpe fonctionnalité ya Thunderbird

source: Learn all you need to know to get Firefox for Android up and running.
ln: Yekola nionso oyo esengeli oyeba mpo na kosalela Firefox mpo na Android.

source: Learn all you need to know to get started with Firefox.
ln: Yekola nionso oyo osengeli nayango mpo na kobanda na Firefox.

source: Learn how to add and manage contacts, as well as make one-to-one or conference calls on your Firefox OS phone.
ln: Yekola ndenge ya kobakisa mpe kokamba bacontact, na mpe kosala baappel ya moko-na-moko to ya conference na telefone nayo Firefox OS.

source: Learn how to change your toolbar, font sizes and browser colors
ln: Yekola ndenge ya kobongola barre ya outil, ba tailles de police mpe balangi ya navigateur

source: Learn how to configure the Internet connection, display and time on your Firefox OS device.
ln: Yekola ndenge ya koconfigurer connection Internet, bomonisi mpe ntango na Firefox OS nayo.

source: Learn how to create and share your own webpages quickly and easily.
ln: Yekola ndenge ya kokela mpe kokabola ba webpages nayo mei na lombango mpe bopete.

source: Learn how to create, assess and issue badges
ln: Yekola ndenge ya kokela, kosembola mpe kopesa ba badges

source: Learn how to download Firefox on your desktop devices or move information to and from other browsers.
ln: Yekola ndenge ya kotélécharger Firefox na ordinateur nayo ya bureau to kozwa to kotinda bainfo na banavigateur misusu.

source: Learn how to fix problems with Gmail, Yahoo and other email providers
ln: Yekola ndenge ya kobongisa bankokoso na bafournisseur ya email Gmail, Yahoo mpe basusu

source: Learn how to import or export your information between Firefox and another browser
ln: Yekola ndenge ya kobenda mpe koexporter bainfo nayo kati ya Firefox na navigateur mosusu

source: Learn how to inspect the code behind every webpage.
ln: Yekola ndenge ya koinspecter code oyo eza sima ya webpage nionso.

source: Learn how to install and transfer information to Firefox for Android.
ln: Yekola ndenge ya koinstaller mpe kotransferer bainfo na Firefox mpo na Android.

source: Learn how to keep your information safe and secure with Firefox's private browsing, password features and other security settings.
ln: Yekola ndenge ya kobatela mpe kokengela bainfo nayo na navigation ya sekele ya Firefox, baparamètre ya liloba ya sekele mpe baparamètre misusu ya bokengi.

source: Learn how to manage your email messages
ln: Yekola ndenge ya kokamba bamessage email

source: Learn how to remix web video, audio and images into mashups that you can embed on other websites.
ln: Yekola ndenge ya koremixer web vidéo, audio mpe bilili na mashups oyo okoki koincorporer na ba sites web misusu.

source: Learn how to troubleshoot issues on your Firefox OS phone.
ln: Yekola ndenge ya kobongisa bankokoso na telefone nayo Firefox OS.

source: Learn how to view content on another screen
ln: Yekola ndenge ya kotala contenu na écran mosusu

source: Learn more about Mozilla's privacy and security practices.
ln: Yekola ebele na maye matali oyo esalemaka na confidentialité mpe bokengi ya Mozilla.

source: Learn more about Wi-Fi, Bluetooth and NFC connections.
ln: Yekola ebele na maye matali Wi-Fi, Bluethooth mpe Baconnection NFC.

source: Learn new things
ln: Yekola makambo yasika

source: Learn the basic about Open Badges
ln: Yekola mateya ya ebandeli na maye matali Ba Badges Ya Kofungwama

source: Learn the basic functionality for your Firefox OS phone.
ln: Yekola fonctionnalité ya base mpo na telefone nayo Firefox OS.

source: Learn the Basics: get started
ln: Yekola mateya ya ebandeli: banda

source: Learn the Basics. Get Started
ln: Yekola Mateya ya Ebandeli. Banda

source: Learn tips and shortcuts to help you work faster
ln: Yekola mayele mpe ba raccourcis mpo na kosalisa yo osalaka na lombango

source: Learn to find and install open apps to add more fun and functionality to your device
ln: Yekola ndenge ya kozwa mpe koinstaller baapps ya kofungwama mpo na kobakisa mingi ya kosepelisa mpe fonctionnalité na appareil nayo

source: Learn to set up accounts, read, send and manage emails
ln: Yekola ndenge ya kosala bacompte, kotanga, kotinda mpe kokamba ba emails

source: Leave a message for {contributor}:
ln: Tika message mpo na {contributor}:

source: Leave a message for {rest} and {last}:
ln: Tika message mpo na {rest} na {last}:

source: Legal Notices
ln: Mayebisi Ya Kimibeko

source: Less than
ln: Na se ya

source: Let's make Mozilla Support speak your language!
ln: Tika tosala ete Mozilla Support esolola lokota nayo!

source: Let us know which of the above you would be interested in and we’ll help you get started. It’s great to have you onboard!
ln: Yebisa biso nini ya oyo ekomami awa likolo ekosepelisa yo mpe tokosalisa yo obanda. Eza esengo mingi kozala nayo elongo!

source: Limited Data
ln: Badonnée Limitée

source: Link to this post.
ln: Kangisa na article.

source: Live
ln: Na bomoyi

source: {l} Knowledge Base Discussions
ln: {l} Masolo Oyo Etali Boyebi

source: Locale
ln: Lokota

source: Locale:
ln: Lokota:

source: Locale Editors
ln: Baediteur Ya Lokota

source: [{locale}] KB Team
ln: [{locale}] Equipe Ya Oyo Etali Boyebi

source: Locale Leaders
ln: Bakambi Ya Lokota

source: [{locale}] Locale Metrics
ln: [{locale}] Bamesure ya Lokota

source: [{locale}] Localization Team
ln: [{locale}] Equipe Ya Ndimbola

source: Locale Metrics
ln: Bamesure ya Lokota

source: {locale_name} Discussions
ln: {locale_name} Masolo

source: {locale_name} Discussions | Knowledge Base
ln: {locale_name} Masolo | Oyo Etali Boyebi

source: [{locale}][{product}] Localization Dashboard
ln: [{locale}][{product}] Tableau de bord Ya Bolimboli

source: Locale Reviewers
ln: Bareviseur Ya Lokota

source: Locales
ln: Nkota

source: Locales | Knowledge Base
ln: Nkota | Oyo Etali Boyebi

source: {locale} translation:
ln: kolimbola {locale}:

source: Localization
ln: Ndimbola

source: Localization Dashboard
ln: Tableau de bord ya Ndimbola

source: Localization Metrics
ln: Bamesure Ya Ndimbola

source: Localization Percentage
ln: Pourcentage ya Bolimboli

source: Localization status of all canned responses
ln: Lolenge ya Ndimbola ya biyano binso biye bilengelami

source: Localization Team
ln: Equipe ya Ndimbola

source: Localize the document
ln: Limbola document

source: Locked
ln: Eza bloqué

source: Lock this question
ln: Bloquer motuna oyo

source: Lock this thread
ln: Bloquer mulongo oyo

source: Logged in!
ln: Okoti!

source: Logging in...
ln: Oza kokota...

source: Log in
ln: Kota

source: Login Problems?
ln: Nkokoso mpo na kokota?

source: Log In / Register
ln: Kokota / Komikomisa

source: Log in, so you can respond to your question when it is answered:
ln: Kota, mpo ete oyanola na motuna nayo tango bakoyanola yango:

source: Log in to an existing account
ln: Kota na compte oyo eza kosala

source: Look at the top of your screen, and click the menu item called <em>Edit</em>.
ln: Tala na likolo ya écran nayo, mpe cliquer na menu oyo ebiengami <em>Bongisa</em>.

source: Look at the top of your screen, and click the menu item called <em>Help</em>.
ln: Tala na likolo ya écran nayo, mpe cliquer na menu oyo ebiengami <em>Lisalisi</em>.

source: Love Firefox and have a few moments to help?<br /> Help other Firefox users on Twitter. Good things will come to those who tweet!
ln: Olingi Firefox mpe oza na mua ngonga ya kosalisa?<br /> Salisa basaleli misusu ya Firefox na Twitter. Makambo malamu makoya epayi ya baye bakotinda tweet!

source: Love Firefox? Love Twitter?
ln: Olingi Firefox? Olingi Twitter?

source: Maintenance in progress
ln: Entretien eza kosalema

source: Major content changes that will make older translations inaccurate
ln: Mbongwana minene ya contenu miye mikosembola ndimbola te

source: Make Firefox for Android work the way you want through customization.
ln: Sala ete Firefox mpo na Android esala ndenge olingi na nzela ya personnalisation.

source: Make Firefox for Android yours with these customization options
ln: Komisa Firefox mpo na Android yayo na baoption ya personnalisation oyo

source: Make Firefox yours by adding and managing the features that you want.
ln: Komisa Firefox yayo na nzela ya bobakisi mpe bokambi bacaractèristique olingi.

source: Make Firefox yours through customization settings and add-ons
ln: Komisa Firefox yayo na nzela ya personnalisation ya baparamètre mpe bibakisi

source: Make my email public
ln: Tiya email nangai ezala publique

source: Make privacy a key factor in selecting and interacting with partners.
ln: Kosala ete confidentialité ezala facteur clé na boponi mpe na tango ya masolo na bapartenaire.

source: Malware
ln: Ya mabe

source: Manage add-ons
ln: Kamba bibakisi

source: Manage preferences and add-ons
ln: Kokamba bapréférence mpe bibakisi

source: Manage watch list
ln: Kamba liste ya kolanda

source: Many thanks for your contribution in behalf of SUMO and the happy users who get help!
ln: Matando mingi mpo na contribution nayo na nkombo ya SUMO mpe basaleli oyo basepeli kozwa lisalisi!

source: Many thanks for your contribution on behalf of SUMO and the happy users who are helped by your work!
ln: Matondo mingi mpo na contribution nayo na nkombo ya SUMO mpe esengo mingi na basaleli baye bazwi lisalisi na nzela ya mosala nayo!

source: Mark as Ready for Localization
ln: Tiya Elembo bo Elengelami mpo na Kolimbola

source: Mark as spam
ln: Tiya elembo bo spam

source: Marked as spam
ln: Etiyami elembo bo spam

source: Marked as spam by %(marked_by)s at %(marked_time)s
ln: Etiyami elembo bo spam na %(marked_by)s at %(marked_time)s

source: Marketplace: Developer Support Request
ln: Marketplace: Bosenga Ya Lisungi Ya Developpeur

source: Marketplace: Request a Refund
ln: Marketplace: Senga Bozongisi Misolo

source: Mark it as solved
ln: Tiya elembo bo eyanolami

source: Mark read
ln: Tiya elembo bo etangemi

source: Mark Selected as Read
ln: Tiya elembo na message oyo Eponami bo etangemi

source: Mark unread
ln: Tiya elembo bo etangemi te

source: Media Gallery
ln: Gallerie Media

source: Media Gallery Search
ln: Boluki Gallerie Media

source: Message from the reviewer:
ln: Message kowuta na reviseur:

source: Message is empty
ln: Message eza polele

source: Message is too long
ln: Message eza molayi mingi

source: Message Preview:
ln: Emoniselo Yambo Message:

source: Messages
ln: Bamessage

source: Messages didn't add up. Try again.
ln: Bamessage ebakisami te. Meka lisusu.

source: Metrics
ln: Bamesure

source: Minor details that don't affect the instructions
ln: Badétail ya mike mike oyo eza koaffecter mitondo te

source: Misc
ln: Miziki

source: Mobile device
ln: Appareil mobile

source: Mobile OS for smartphones
ln: Mobile OS mpo na ba smartphones

source: Model not allowed.
ln: Modele endimami te.

source: Moderate Forum Content
ln: Contenu Ya Forum Moderé

source: Moderate Twitter Accounts
ln: Kokitisa Bacompte Twitter

source: moderator
ln: moderateur

source: Moderator
ln: Moderateur

source: Modified:
ln: Ezalaki modifié:

source: Modified by {name} on {datetime}
ln: Ezalaki modifié na {name} mokolo ya {datetime}

source: Modified {datetime} by {name}
ln: Ezalaki modifié {datetime} na {name}

source: Modified Preferences
ln: Bapréférence oyo eza modifié

source: Monthly Active Contributors
ln: Bacontributeur Actif na Sanza

source: More system details
ln: Badétail misusu ya systeme

source: More than
ln: Koleka

source: More than one level 2 review change drops the localization to 0%
ln: Bongwana ya bomanyolami ya niveau 2 koleka moko ekitisaka ndimbola na 0%

source: Most Recent
ln: Ya kala mingi te

source: Most Viewed
ln: Oyo batali mingi

source: Most Visited
ln: Oyo bavisiter mingi

source: Mozilla Support
ln: Lisungi Ya Mozilla

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe.
ln: Lisungi Ya Mozilla eza lingomba ya bavolontaire mpe basali baye bamipesi motema mobimba mpo na kosunga basaleli babiso mokili mobimba.

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe. Join us for an incredible adventure!
ln: Mozilla Support eza lingomba ya bavolontiare mpe basali baye bamipesi motema mobimba mpo na komeka kosunga basaleli babiso mokili mobimba. Sangana na biso mpo na makambo kitiko ya kokamwisa!

source: Mozilla support is fully powered by our volunteer community that is helping hundreds of users everyday. This community is formed by passionate Firefox and Thunderbird users who take some of their spare time to help others. We couldn't do it without your passion and enthusiasm. Your contribution, as minor as it might seem, has tremendous value. Solving one issue in the support forums can help up to 1000 users a day!
ln: Mozilla support esimbami na lingomba ya bavolontaire nabiso liye lizali kosalisa ebele ya basaleli mikolo nionso. Lingomba oyo lisalemi na baye balingaka Firefox mpe basaleli Thunderbird baye bazwaka mua ngonga na tango nabango mpo na kosalisa basusu. Tokokaki te kosala yango soki te na bolingo mpe komipesa nabino. Contribution nabino, atako ekoki komonana moke, eza na litomba monene. Kondimbola likambo moko nakati ya baforum ya lisungi ekoki kosalisa basaleli ebele mpeza na mokolo!

source: Mozillians
ln: Bayi Mozilla

source: Mozillians Username
ln: Nkombo ya bosaleli ya Bayi Mozilla

source: Multiple Products
ln: Baproduit Ndenge na Ndenge

source: Music, Photos and Video
ln: Miziki, Bafoto mpe Vdéo

source: My contributions
ln: Bacontribution nangai

source: My password isn't working.
ln: Liloba nangai ya sekele eza kosala te.

source: My profile
ln: Profile na nangai

source: My Questions
ln: Mituna Nangai

source: Need Changes
ln: Esengeli na mbongwama

source: needs attention
ln: esengeli na bokebi

source: Needs change
ln: Esengeli na mbongwana

source: Needs change:
ln: Esengeli na mbongwana:

source: Needs info
ln: Esengeli na bainfo

source: Needs more information
ln: Esengeli na bainfo misusu

source: Needs Update
ln: Esengeli na mise à jour

source: New announcement for {group}
ln: Mayebisi yasika mpo na {group}

source: New answers for question: %s
ln: Biyano yasika mpo na motuna: %s

source: New Article
ln: Article Yasika

source: Newer
ln: Yakala

source: New Message
ln: Message Yasika

source: New password
ln: Liloba Ya Sekele Yasika

source: New password:
ln: Liloba ya sekele yasika:

source: New Password
ln: Liloba Ya Sekele Yasika

source: New Password Again
ln: Liloba Ya Sekele Yasika Lisusu

source: News &amp; Resources
ln: Bansango &amp; Ressources

source: News Feeds (RSS), Blogs and Social
ln: Basango ya Feeds (RSS), Ba Blogs mpe Social

source: New thread: {title}
ln: Mulongo yasika: {title}

source: next
ln: oyo elandi

source: Next
ln: Oyo elandi

source: No
ln: Te

source: No, I'm not.
ln: Te, naino namikomisi te.

source: No media files found.
ln: Fichier ata moko te ya media ezwami.

source: No messages selected. Please try again.
ln: Message moko te eponami. Meka lisusu.

source: None
ln: Moko te

source: None of these solve my problem
ln: Ata moko te eyanoli nkokoso nangai

source: No one has helped translate this article yet. If you already know how localizing for SUMO works, <a href="%(document_trans_link)s">start translating now</a>. If you want to learn how to translate articles for SUMO, <a href="%(help_link)s">please start here</a>.
ln: Mutu moko te naino asalisi mpo na kolimbola article oyo. Soki osili koyeba ndenge kolimbola mpo na SUMO esalaka, <a href="%(document_trans_link)s">banda kolimbola sik'oyo</a>. Soki olingi koyekola ndenge ya kolimbola baarticle mpo na SUMO, <a href="%(help_link)s">banda awa</a>.

source: No other documents link to {title}.
ln: Document mosusu te ezosala lien na {title}.

source: No pages matched the search criteria
ln: Lokasa moko te lokokani na critere ya boluki

source: No related documents.
ln: Document ata moko te oyo elandani.

source: No replies
ln: Eyano ata moko te

source: No Surprises
ln: Mpwasa ata moko te

source: Note: Searching for "tag1, tag2" returns questions tagged with both tag1 and tag2
ln: Yeba malamu: Boluki "tag1, tag2" ezongisaka mituna miye mitiyamaki na ba tag wana mibale tag1 na tag2

source: Note: There are no approved translations for this article.
ln: Yeba: Eza na Ndimbola ata moko te eye endimami mpo na article oyo.

source: Note: This article has no revisions ready for localization.
ln: Yeba: Article oyo eza na revision ata moko te oyo elengelami mpo na ndimbola.

source: No Thanks
ln: Te, Matondo

source: Not Helpful
ln: Ya Ntina Te

source: Notify me of any future changes to this page
ln: Yebisa ngai mbongwana nionso oyo ekosalema na lokasa oyo

source: Not sure how often
ln: Eyebani malamu te mbala boni

source: No users were found for your search query.
ln: Mosaleli moko te azwami mpo na bosenga ya boluki nayo.

source: Now you can combine both and help Firefox users on Twitter. It's quick, it's easy, and you don't have to be a tech superstar to do it. We call it our Army of Awesome.
ln: Sik'oyo okoki sosangisa yango nionso mibale mpe kosalisa basaleli ya Firefox na nzela ya Twitter. Eza ya lombango, mpe esengeli te ozala moyebi monene ya tech mpo na kosala yango. Tobiangaka yango Army of Awesome nabiso.

source: {num} answers
ln: biyano {num}

source: %(number)d day ago
ln: mikolo %(number)d mileki

source: %(number)d hour ago
ln: ngonga %(number)d eleki

source: %(number)d minute ago
ln: minuti %(number)d mileki

source: %(number)d month ago
ln: sanza %(number)d eleki

source: %(number)d second ago
ln: seconde %(number)d eleki

source: %(number)d week ago
ln: baposo %(number)d eleki

source: %(number)d year ago
ln: mibu %(number)d mileki

source: Number of active Army of Awesome contributors
ln: Motango ya bacontributeur na Army of Awesome

source: Number of active contributors to the English KB
ln: Motango ya bacontributeur actif na Oyo Etali Boyebi na lokota ya Angele

source: Number of active contributors to the non-English KB
ln: Motango ya bacontributeur actif na Oyo Etali Boyebi na lokota ya Angele te

source: Number of active forum contributors
ln: Motango ya bacontributeur actif na forum

source: Number of answers
ln: Motango ya biyano

source: Number of Answers
ln: Motango ya Biyano

source: Number of replies
ln: Motango ya biyano

source: Number of Replies
ln: Motango ya Biyano

source: Number of votes. Must be an integer.
ln: Motango ya bavote. Esengeli ezala entier.

source: %(numerator)s of %(denominator)s
ln: %(numerator)s ya %(denominator)s

source: %(numerator)s <small>of %(denominator)s</small>
ln: %(numerator)s <small>ya %(denominator)s</small>

source: {num} solutions
ln: basolution {num}

source: {num_views} views
ln: bavue {num_views}

source: Object does not exist.
ln: Objet eza te.

source: Obsolete:
ln: Esila ngenge:

source: Official blog
ln: Blog officiel

source: Oh, no! It looks like an unexpected error occurred. We've already notified the site administrators. Please try again now, or in a few minutes.
ln: Oh, te! Eza neti erreur moko oyo ekanamaki te esalemi. Tosi toyebisi ba administarteur ya site. Meka lisusu sik'oyo, to sima ya mua minuti.

source: Oh, no! Looks like there are no posts!
ln: Oh, te! Emonani neti article moko te eza!

source: Older
ln: Yasika

source: Old Password
ln: Liloba Ya Sekele Yakala

source: %(old)s-redirect-%(number)i
ln: %(old)s-botindami-%(number)i

source: %(old)s Redirect %(number)i
ln: %(old)s Botindami %(number)i

source: Once you’ve clicked on the link, you can throw away this email.
ln: Tango osi ocliquer na lien, okoki kobwakisa email oyo.

source: Only displayed on search results page
ln: Bobele oyo omonani na lokasa ya barésultat ya boluki

source: Only use and share information about our users for their benefit and as disclosed in our notices.
ln: Salela mpe kabola bobele bainfo eye etali basaleli nabiso mpo na litomba nabango mpe ndenge elakisami na mayebisi mabiso.

source: Oops, your request was unsuccessful
ln: Aïe, bosenga nayo esimbi te

source: Open Badges
ln: Ba Badges ya kofungwama

source: Open <em>Help &gt; Troubleshooting Information</em>.
ln: Fungola <em>Help &gt; Bainfo Ya Dépannage</em>.

source: Operating system
ln: Système d'exploitation

source: Original post date
ln: Mokolo ya article original

source: Other
ln: Mosusu

source: Other Mozilla products
ln: Baproduit misusu ya Mozilla

source: Other (please specify)
ln: Mosusu (sembola)

source: Other products
ln: Baproduit misusu

source: Other questions with Firefox for Windows 8 Touch.
ln: Mituna misusu na Firefox mpo na Windows 8 Touch.

source: Other reason:
ln: Ntina mosusu:

source: Other ways to get involved
ln: Banzela misusu ya kokomikotisa
